{"title":"YC W17 Launch: Moneytis and Tolemi","endpoint":"Y Combinator","description":"\n                         We’re in the middle of YC’s W17 batch. As companies launch they’ll be doing a Q&A on Hacker News – aka Launch HN – in addition to being included in a roundup on the blog. Here are the companies that have recently launched.\n\nMoneytis\nWhat does your company do?\nMoneytis is the cheapest way to send money between 2 countries. People come on our website, put the amount they want to send and where they want to send it. We compare the prices between the 60 top providers and use the cheapest to send their money.\nWho are your customers?\nAnyone living abroad. An expatriate transferring his salary to pay his mortgage back home. A Mexican migrant in the US who is supporting his family back home. An international student receiving money from his parents. Or even a retiree selling his house to travel around the world.\nWhat is the primary problem you are solving and why has no one solved it before?\nEvery country has a large number of money transfer services. +300 services have been created over the last 3 years. They are not very transparent with their prices which make it difficult to compare. Even worse, these services change their prices all the time, so customers know that they are getting screwed but they have no easy way to compare prices. We connect to all these money transfer services using an API so we can compare prices in real time and increase transparency.\nWho are your competitors?\nMost money transfers are done through banks, and they are the one which charge the highest fees.\nWhat is the primary reason why people use your product over a competitor?\nSave time when searching for a safe alternative to their bank. And save money by using the best one via Moneytis. Sometimes the money transfer service is exclusively on Moneytis.\nWhy did you decide to start the company?\nEtienne and I [Christophe] are French and met 6 years ago. We were working for a fast growing consulting company in Switzerland. We went everywhere in the globe to help building this company, including China. As expatriates, we were facing hidden fees all the time sending money back home, in every country. We decided to list all the solutions which existed, and compared them. Quickly, our friends wanted to access our data and we ended up launching a comparison tool. We then understood our users also wanted both a comparative analysis and a way to transfer easily, this is the part we are launching now.\n\nTolemi\nWhat does your company do?\nTolemi delivers a smart city technology product, BuildingBlocks, that helps state and local governments take a data-driven approach to rebuild cities and towns.\nHow does it work?\nBy integrating and analyzing the critical vital signs of real property and neighborhoods across city data silos, Tolemi helps city leaders use a few mouse clicks to understand their communities and deploy resources/services to protect property value and enhance neighborhood livability. It’s a “neighborhood mission control”.\nWho are your customers?\nState and local government departments and agencies that administer real property and the built environment – Departments of Planning, Community Development/Neighborhood Services, Code Enforcement, Police/Fire, and City Management.\nWhat is the primary problem you are solving and why has no on solved it before?\nPost-industrial decline and the foreclosure crisis have left American communities struggling with distressed properties, resulting in the loss of $7 trillion in household and private wealth. Depressed property values also means a smaller property tax base, the critical lifeblood of municipal funds. Governments have policy tools and resources to combat distress, but departments and agencies tend to act in silos and with incomplete information.\nPublic sector innovation is inherently difficult because of the requirement to work with legacy information systems, local capacity constraints, lacking political will, long timelines, and the fact that data-sharing for performance analysis among multiple departments and agencies – CompSTAT – is relatively new practice that was only recently spearheaded by the law enforcement, but now being adopted by departments and agencies more widely.\nWho is your competition?\nMost often, status quo is the primary competitor. Occasionally, governments try to build their proprietary solutions or hire consultants to provide a static assessment. Select geo-spatial providers like ESRI/ArcGS have spatial analysis offerings, but no comprehensive solution for this problem.\nWhat is the primary reason why people use your company over a market competitor?\nWe apply the leading data integration and spatial analysis techniques to empower cities with real-time, quick, and simple to use urban analytics that are web-based and do not disrupt their IT stack and legacy software. Our product is a fraction of cost and time to build internally or to hire consultants to conduct a study that is obsolete in a few months.\nWhat is your traction?\nCities and town across the U.S. including Buffalo, NY; Louisville, KY; Providence; RI; Philadelphia, PA as well as places like Lorain, OH and Haverhill, MA are current clients/partners and we are now finalizing contracts with more than three dozen to onboard in the 2nd Quarter of 2017.\n                                             "}