{"title":"YC W17 Launch: Tress","endpoint":"Y Combinator","description":"\n                         We’re nearing the end of YC’s W17 batch. As companies launch they’ll be doing a Q&A on Hacker News – aka Launch HN – in addition to being included in a roundup on the blog. Here’s who has recently launched.\n\nTress\nWhat does your company do?\nTress is a social community for black women’s hairstyles. Women upload photos of beautiful hairstyles and discuss how to replicate the look, which products were used and where to get similar hairstyles. They also discuss their hair needs with an engaged community on the Q&A section.\nWho are your customers?\nWe are targeting the 115 million black women in America, Caribbean, Africa, Asia and Europe with smartphones, who are online and who are crazy about their hair.\nWhat is the primary problem you are solving and why has no one solved it before?\nMany black women spend a considerable amount of time on different platforms searching for their next hairstyle, then spend a good amount of time figuring out if they can replicate the style on their own via hair tutorial articles/videos or searching for a stylist who can replicate the style. Additionally, they will then have to find out where to buy specific products for that style. It’s a lot of work just for one hairstyle.\nWho are your competitors?\nOur competitors are apps, blogs and websites that have accumulated a huge following for niche black hair related topics. Instagram will be considered a competitor because many black women currently use it for their hairstyle inspiration, but because of its generalist nature, there is a gap between find amazing hairstyle inspiration and getting relevant information about hairstyles. The process of finding hair products and booking salon appointments is totally broken on available online platforms.\nWhat is the primary reason why people use your product over a competitor?\nWe are building a single platform for women to find hairstyle inspiration, purchase products, book stylists and discuss their hair needs with an engaged community. Unlike other topics, it’s significantly more useful to talk to women that have your specific hair type and hair needs. It’s a targeted community for black women’s hairstyles.\nWhy did you decide to start Tress?\nWe are software engineers who are extremely passionate about solving a challenge that we personally face. We did not want to wait for someone else to maybe provide a future solution to our current problem. The black haircare industry is a huge industry and we believe technology is a key in addressing the hair challenges that black women face. We are building a product that we need ourselves.\n                                             "}