{"title":"Ask a Female Engineer: How Can Managers Help Retain Technical Women on Their Team?","endpoint":"Cadran Cowansage","description":"\n                         In the ongoing conversation about women in tech, we hear a lot about women leaving companies and even the industry as a whole, so we decided to ask a group of female engineers what reasons have prompted them to leave companies in the past, or what might motivate them to move out of a technical role.\n\nIn the past, what are the reasons that have contributed to your decision(s) to leave a particular company? How can managers help retain technical women on their staff?\nAdele: The biggest factor for me has been when an employer promises changes to how the tech team is managed and then doesn’t deliver on them. To a certain extent all teams struggle with the trade-offs between spending time developing good specs versus staying agile, and between addressing technical debt and building new features. But I’ve left companies after years of chaotically fighting fires while simultaneously needing to build new features, or after repeatedly getting disorganized braindumps or single line descriptions from stakeholders rather than the thoughtful, detailed specs they’ve promised.\nFrances: I’ve heard the quote “people leave managers not companies” a number of times and from my experiences it’s true. I almost always leave companies because I don’t think I can work effectively with my boss anymore.\nI think the best way for a company to solve these kinds of manager-related issues is to create a clear process for employees to report issues about their managers to someone else in leadership outside their reporting chain. Reporting these issues to HR comes with a lot of stigma at a lot of companies and HR may not even exist at small start-ups. Making sure your team members have a comfortable relationship with someone in leadership outside their reporting chain is important; having someone who they feel they can go to with manager-related problems is key.\nHistorically I haven’t spoken up about issues with my manager because I fear it’ll dangerous for my career or reputation. I might be perceived as a troublemaker by the management team. Especially as a woman, I worry about being labeled hyper-sensitive, or that my gender will influence a person’s reaction to my feedback (e.g. the perception that women are hysterical). If a company’s leadership feels too tightly knit – where all the managers and founders are friends that aren’t open to critical feedback from employees – I won’t even try to work out the issue before leaving.\nAlso one more point – It’s important that an employee doesn’t become responsible for solving problems they’ve reported. That employee shouldn’t have to train their boss in order to make the relationship productive. I’ve experienced this outcome first-hand and also hear about it from friends.\nGrace: I have made the decision to leave companies because of things like a lack of growth opportunities and toxic coworkers or managers. I also left a company once after asking for higher pay when I knew that people with less experience and less skill were paid more than me. When I was told the company couldn’t give me a raise but could give me a one-time bonus, I decided to move on. I’ve never regretted the decision.\nI’m a lot more likely to stick around if my manager gives me growth opportunities, listens to me, and asks me what I think.\nAda: Usually a few things happen that get me thinking about leaving and then another, final event pushes me over the edge and really motivates me to get a new job.\nSome examples of contributing factors from my past are that I’ve lost faith in my boss’ or manager’s ability to advocate for me, or I don’t feel there’s an opportunity for professional growth.\nThen I might see an email from a recruiter about a job that sounds exciting and that pays well. I’ll start to consider leaving, and then someone I work with – usually my boss or manager – does something that makes me angry. Angry enough to rewrite my resume, email a recruiter back, brush up on interview questions and whiteboarding, and get off my butt and go interview. I’m like a plant that gets dried out in an environment I no longer feel nurtured in. The final straw has typically been something like my manager making an off-hand remark that is thoughtless and rude, or perhaps a project I care about deeply is axed, or I’m denied a raise, or someone I care about at work is sexually harassed or gets fired.\nHere are some things that will make me want to stay at a job:\nHaving a boss who listens. Sometimes a manager can’t give me what I want, but listening to my concerns and considering them makes me feel respected and valued. Some examples of behaviors that make me feel that I’m not valued are when my boss skips my one-on-ones, zones out during stand-ups, or looks at their phone or email during meetings. It’s important that my boss checks in with me even if I seem happy or like I’m doing really well. I don’t want to be asked for feedback only when things aren’t going well. When my boss respectfully listens to feedback and strives to incorporate at least some of it, I’m much more likely to stay at a company.\nReceiving constructive feedback is important to me. One thing I’ve noticed is that managers are often afraid to provide critical feedback. Without such feedback, I’m left to wonder whether I’m doing well, which is distracting. If I’m given critical feedback in a respectful and kind way that emphasizes helping me become a better version of myself, then I’ll feel like my employer is investing in me and wants me to grow as engineer. Also, it’s important that I receive both verbal and monetary recognition when I improve or do good work.\nDorothy: One thing that really frustrates me is when excellent engineers are “promoted” to managers whether or not they are well-suited for the role. Then on top of that they are not given any meaningful mentoring – that tends to lower the quality of overall productivity and the atmosphere.\nKlara: I’ll leave a company when I no longer believe in the company’s success, when I’m not growing professionally, and when I don’t get along with someone in the office, usually my boss. If only one of those issues is true, then there’s probably enough reason to stay and I’ll try to resolve the problems.\nAt a startup it can be hard to decipher whether your company is doing well, especially since progress isn’t always in a continuous, upward direction. As an employee, you’re not always privy to important information that would help you figure it out, especially if the company is struggling. I’ve often felt that trying to determine how well my company is doing is a guessing game. So then I turn to assessing my personal growth because that’s in theory more straight-forward. I ask myself questions like: How much have I learned? Do I get feedback? Am I challenged? What else can I accomplish here? If I can get excited about what’s next for me at a company, I will stay. If I can mix things up enough and learn new things where I am without actually finding a new job, I will do that.\nThe other big reason I’ll leave my job is when I don’t enjoy working with my boss. I’ve always struggled to manage up. It’s much easier to leave than to figure things out with a nightmare manager. Toxic work relationships make me angry and frustrated, which I’ve found leaks over into the rest of my life. When that happens it’s a sign that I need to leave.\nDorothy: I’ve left a company when it was no longer a good place for me to work, but I can’t recall those reasons being at all related to being a woman. I usually leave for one of the following reasons: too much office politics, as the company grows I feel job definitions are becoming too narrow, hiring standards decline and new hires are less effective are hired, or I start to feel micromanaged.\nAny and all demonstration from the management team that they have a strong commitment to supporting women (technical or otherwise) within the company will make me less likely to want to leave, even if it’s “time”.\nBetty: I have worked full-time at four companies. I left once to pursue grad school, but the other two times were because of my immediate manager. In that case I had a manager/tech lead who didn’t know much about the underlying technology we were using, but wanted to control it tightly anyway. It quickly became a situation where I had a lot of responsibility but no authority, and the higher management didn’t care. So I left as soon as I found a good opportunity.\nAnother time I had a very good manager and mentor, but I mostly had to work with people on other teams, where there were complex issues related to ego and territorial defensiveness. I made my manager and mentor aware of the situation, and they acknowledged it, but said they couldn’t do anything to fix it because of company politics. In that situation my manager agreed with my decision to leave and gave me a glowing recommendation.\nJean: I tend to be an optimist. I’ve stayed at companies that were crumbling and going bankrupt because the people on my team were awesome and the work was exciting and interesting. I left a well-paid, financially solid, large company when my group/product meant nothing to the company. I felt that what I did didn’t matter – that was clear because when others left there was no replacement hiring for them.\nEdith: I’ve left jobs when my manager has forced me to do useless tasks over and over again for purely political reasons, when I don’t feel my voice is heard or my relevant experience trusted. One time I presented a rational justification to a founder I was working for explaining why we weren’t going to make a set deadline and they told me I was “just thinking inside the box.” It wasn’t clear to me whether my gender or age (I was in my mid-20s at the time) factored into the founder’s behavior, but either way, I think employees regardless of age or gender ought to be heard and trusted if they bring data, logic, and rational explanations to arguments. In the end, I was 100% right, a fact which took the founder a year after my resignation to admit to me.\n\nHave you considered leaving tech or moving into a non-technical role? If so, why?\nJean: I’ve never considered leaving my technical job. Evolving into a technical manager is not something I am at all interested in. The qualities that make a great software engineer have little overlap with the qualities that make a great people manager. Yes, I’d describe myself as an introverted, detail-oriented control freak. Those are great for programming and debugging tough issues. But introverted and control freak are terrible qualities in a manager.\nDorothy: I used to work as a developer a long time ago and found myself frustrated and unhappy because while I’m super-technical, I’m also super-extroverted. Working at my desk every day on the same thing drove me nuts. I considered leaving tech before I realized there were many other tracks within tech for someone who has the technical skills but also wants to work with other people (and on lots of different projects). The result has been I usually work for very small start-ups. At my last two companies I worked on everything from pre-sales, technical consulting, customer training, conferences talks and a lot of product work. Luckily I’ve found lots of great opportunities outside of pure dev so I’m still very much in tech.\nAda: Yes, for sure. Business school, people management, product management, project management, masters in fine arts, PhD in physics, PhD in computer science, venture capital, teaching, and the list goes on.\nI’ve stuck with tech so far because the money is good and because I still believe I can work at companies solving interesting problems. I start thinking about leaving tech whenever I feel disillusioned with the problems I am solving on a macro scale. It’s hard to feel excited about your job when you’re not creating value for anyone except the VCs who funded you, and sometimes maybe not even them.\nAdele: At the company I work for we have product owner roles and technical team leads. The technical team lead role also holds a people management component that I’m not as interested in. We also have the concept of ‘senior’ developers, but it feels like all of the decision making happens between product management, scrum master and team lead.\nI think every now and again about moving towards being a product manager, because it feels like they make the most decisions. Our product managers are still beholden to the company, but I do feel like they have the power to ask for projects and time in a way a developer cannot.\nKlara: I have thought about returning to finance, where I worked before starting to code, and teaching. When I feel like a code monkey – i.e. get a ticket, build a feature, and repeat, then I find programming isolating and boring. Right now when I look at my job, and envision the next 5 years, it looks like more of the same thing. I recently started teaching high school kids how to code, and that has been immensely gratifying.\nEdith: I spent a decade in technical roles and am now a project manager and team lead. People always question my technical chops/background when I present myself as a PM – it’s super frustrating. I love project management and the work I’m doing now, but I do miss the design reviews and hands-on technical work. My main reason for moving into this role is that I do really love the PM side of things and running teams the way I always wished my teams would be run. Plus, from a long-term career standpoint, the highest impact positions are all generally not technical contribution roles. So here I am.\n                                             "}