{"title":"YC W17 Launch: Credy, Upcall, and Kangpe","endpoint":"Y Combinator","description":"\n                         We’re in the middle of YC’s W17 batch. As companies launch they’ll be doing a Q&A on Hacker News – aka Launch HN – in addition to being included in a roundup on the blog. Here are the companies that have recently launched.\n\nCredy\nWhat does your company do?\nCredy is a peer-to-peer lending platform for India.\nWho are your customers?\nOur customers are typically people with a small to medium ticket personal loan requirement. This can be for debt refinancing, marriage, education or emergency needs. Our customers are those who want fast, hassle-free loans on a recurring basis. Lenders are customers who want good returns on their investment via a safe and trustworthy investment vehicle.\nWhat is the primary problem you are solving and why has no one solved it before?\nTrust is a major pain point in peer lending in India, primarily due to identity theft. Having a biometric verification helps us eliminate fake users and impersonation. Aadhaar, which is India’s social security number backed by biometrics, is the newest and safest tool to fight this problem since it received legal backing in 2016. It covers 1.11 out of 1.27 billion Indians.\nWhat is the primary reason why people use your product over a competitor?\nWe offer fast, paperless online loans for qualified borrowers. We offer a professionally chosen risk managed investment option for lenders. We invest along with our lenders and offer a data & analytics tool. We guarantee 100% genuine and verified borrowers.\nWhy did you decide to start the company?\nAvid investors ourselves, we wanted to lend to peers via a trustworthy and risk managed online investment option. We realized that due to the fast-changing financial landscape and Government policy push, the time was right to launch build such a product ourselves to fund a rapidly growing credit need in India. With extensive financial and technology experience from Goldman Sachs, Societe Generale and Amazon, we felt we could best solve this problem.\nWhy now?\nIndian government and central bank have made it easier to do this business now. Salient developments: In 2016, the central bank proposed guidelines to promote P2P lending. Linking of more services (like digital signatures, payments etc) to Aadhaar Demonetisation (which converted cash into digital money) and launch of a new payment infrastructure\n\nUpcall\nWhat does your company do?\nUpcall provides on-demand outbound call services that make creating and executing call campaigns as easy as email campaigns. Companies create a script and decide who to target, and Upcall takes care of the rest. Upcall uses on-demand, industry-specific professionals to make calls on the company’s behalf. Upcall provides all the tools necessary to integrate into a customer’s workflow and data analytics to assess campaign efficacy.\nWho are your customers?\nHundreds of SaaS companies, real-estate brokers and insurance agents use Upcall to generate new leads and fuel their sales pipeline. For example, B2B SaaS Marketing companies use the Upcall platform and built-in database to target VPs of Marketing in companies that have 50-500 employees and located within 50 miles from San Francisco. On-demand companies are using Upcall’s API to get feedback from existing clients who haven’t been active in a while.\nWhat is the primary problem you are solving and why has no one solved it before?\nUpcall has created a scalable on-demand solution that allows companies to quickly ramp up their sales and customer engagement campaigns through a unified communication platform. What used to take weeks with a call center, now takes less than 10 minutes to build. Upcall makes executing call campaigns as easy as email campaigns. Upcall integrates with all the existing tools of our customers workflow and provides instant access to vetted sales professionals, which makes Upcall fast and simple to use.\nWho are your competitors?\nTraditional Call Centers that require long term commitments and take significant setup time.\nWhat is the primary reason why people use your product over a competitor?\nBuilding a call campaign on Upcall is affordable and easy to set-up. Businesses can train and communicate with top-rated professionals and monitor results in real-time, while also integrating with their existing tools. Plans for the next year. Phone calls are underutilized by most businesses, as it is difficult to scale and time consuming, while at the same time being 3x more effective than emailing. Upcall has the ambition to become the go-to platform for sales, customer success and marketing professionals around the world, looking to generate outbound leads and engage their existing users through meaningful phone conversations.\nWhy did you decide to start the company?\nI was a CEO of various startups and my sales team always tried to do outbound calls to generate more leads or to increase retention but due to the time and budget constraint and size of our company, it was impossible to achieve. So I came up with the idea to build a platform which allows people working from home (such as stay at home mum, students or retired people) to earn money while making calls on behalf of companies in a scalable way.\n\nKangpe\nWhat does your company do?\nKangpe lets Africans access health care from verified doctors using their mobile phones. Users can chat with the doctor via the mobile app, website or SMS and get responses within 10 minutes.\nWho are your customers?\nKangpe is live in Nigeria, Ghana and Kenya.\nWhat is the primary problem you are solving and why has no one solved it before?\nPeople in rural Africa need to travel long distances to see a doctor. Services like Kangpe exist for the US market, but they are too expensive for Africans and not tailored to African health conditions.\n                                             "}