{"title":"Ajokorttitiedot","endpoint":"foobar.com","description":"Trafi kehittää liikennejärjestelmän turvallisuutta, edistää liikenteen ympäristöystävällisyyttä ja vastaa liikennejärjestelmään liittyvistä viranomaistehtävistä. Trafissa työskentelee noin 530 työntekijää yhdeksällä eri toimipaikalla.\r\n\r\nTrafi\r\n\r\n- antaa tarvittavia lupia, hyväksyntöjä ja muita päätöksiä sekä toimialaa koskevia oikeussääntöjä\r\n- vastaa tutkintojen järjestämisestä, toimialan verotus- ja rekisteröintitehtävistä sekä luotettavista tietopalveluista\r\n- valvoo liikennemarkkinoihin liittyviä tehtäviä sekä liikennejärjestelmää koskevien sääntöjen ja määräysten noudattamista\r\n- osallistuu kansainväliseen yhteistyöhön\r\n- huolehtii liikennejärjestelmän toimivuudesta myös poikkeusoloissa ja normaaliolojen häiriötilanteissa\r\n- luo edellytyksiä älyliikenteen innovatiiviseen kehittämiseen\r\n- jakaa tietoa kansalaisille liikkumisen valinnoista.\r\n\r\nhttp://www.trafi.fi/\r\n\r\nTrafi utvecklar transportsystemets säkerhet, främjar trafikens miljövänlighet och svarar för de myndighetsuppgifter som anknyter till transportsystemet.\r\n\r\nTrafi\r\n\r\n- Utfärdar certifikat och licenser, godkännanden och andra beslut samt utfärdar rättsregler som gäller verksamhetsområdet.\r\n- Ansvarar för att prov och examina ordnas, för beskattning och registrering inom verksamhetsområdet och upprätthåller en tillförlitlig informationstjänst.\r\n- Utövar tillsyn över transportmarknaden och över att regler och föreskrifter som gäller transportsystemet följs.\r\n- Deltar i det internationella samarbetet.\r\n - Sörjer för att transportsystemet fungerar också i exceptionella förhållanden och vid störningar i den normala verksamheten.\r\n- Skapar förutsättningar för en innovativ utveckling av intelligent trafik.\r\n - Informerar allmänheten om transportrelaterade val.\r\n\r\nhttp://www.trafi.fi/sv\r\n\r\nFinnish Transport Safety Agency Trafi\r\n\r\nTrafi develops the safety of the transport system, promotes environmentally friendly transport solutions and is responsible for transport system regulatory duties.\r\n\r\nTrafi\r\n\r\n- issues permits, regulations, approvals and decisions and prepares legal rules regarding the transport sector;\r\n- arranges examinations, handles transport sector taxation and registration, and provides reliable information services; \r\n- oversees the transport market as well as compliance with rules and regulations governing the transport system;\r\n- participates in international co-operation;\r\n- ensures the functionality of the transport system even in emergency conditions and when normal operations are disrupted;\r\n- creates opportunities for innovative development of intelligent transport;\r\n- informs the public of transport-related choices.\r\n\r\nhttp://www.trafi.fi/en"}