{"harvester_errors":[{"reason":"Too long description","api_name":"Twilio","desc_start":"\n              Twilio provides a simple hosted API and markup language for businesses to quickly build scalable, reliable and advanced voice and SMS communications applications. Twilio provides a telephony infrastructure web service \"in the cloud\", enabling web programmers to integrate real-time phone calls into their applications. Twilio's simple Pay-As-You-Go pricing model means customers pay for capacity only when they need it, not before. Voice applications written on Twilio's cloud solution scale transparently, eliminating programming, operational and contractual headaches frequently associated with rapid growth or traffic spikes. \n\nTwilio provides a cloud API for voice and SMS communications that leverages existing web development skills, resources and infrastructure. It minimizes the learning curve required to build advanced, reliable voice communications applications that solve critical business needs. The syntax and programming model are focused on making application developme","desc_exceeding":"nt as close to the request/response model of web application development as possible. The API uses a RESTful interface and responses are formatted in XML or CSV.             ","api_url":"https://api.twilio.com/2008-08-01/","mod_sent":0,"is_duplicate":0,"idNo":1},{"reason":"Too long description","api_name":"eBay","desc_start":"\n              eBay's primary web services are found in the three following API's:\n\nThe [[/api/ebay-trading Trading API]] is designed to provide robust support for transactional activities. The services offered by the Trading API allow developers to list items, manage user information, get item information, and manage eBay sales and purchases.\n\nThe [[/api/ebay-shopping Shopping API]] is a more lightweight service that is optimized for buyer shopping and browsing. The Shopping API lets users take searches off of eBay and put them into their own site or application. This API is designed for the creation of buying applications with very fast response times.\n\nThe [[/api/ebay-finding Finding API]] is eBay's next generation search API. The Finding API provides more relevant search results compared to existing search API's and has an array of search refinement capabilities. Developers can leverage the Finding API to integrate more robust searching and browsing experiences into their buying ap","desc_exceeding":"plications.\n\nNote: As of October 2011, eBay has deprecated the GetSearchResults and GetCategoryListings services from the Trading API, and the FindItemsAdvanced and FindItems services from the Shopping API. This functionality has been migrated to the Finding API.            ","api_url":"http://developer.ebay.com/webservices/latest/eBaySvc.wsdl","mod_sent":0,"is_duplicate":0,"idNo":2},{"reason":"Too long description","api_name":"Twilio SMS","desc_start":"\n              Twilio provides a simple hosted API and markup language for businesses to quickly build scalable, reliable and advanced voice and SMS communications applications. Twilio provides a telephony infrastructure web service \"in the cloud\", enabling web programmers to integrate real-time phone calls into their applications. Twilio's simple Pay-As-You-Go pricing model means customers pay for capacity only when they need it, not before. Voice applications written on Twilio's cloud solution scale transparently, eliminating programming, operational and contractual headaches frequently associated with rapid growth or traffic spikes. \n\nThe SMS API allows users to send and receive SMS messages from their applications. The API can implement short code technology to allow both faster and higher volume sms messaging. Example uses of the API include sending customers automatic SMS messages, multi-factor authentication and interactive polling. The API uses a RESTful interface and responses","desc_exceeding":" are formatted in XML.             ","api_url":"http://www.twilio.com/sms","mod_sent":0,"is_duplicate":0,"idNo":3},{"reason":"Invalid URL","api_name":"Microsoft Bing Maps","desc_start":"\n              Bing Maps API and Interactive SDK features an AJAX Map Control. Use BM to build maps which can include routes and traffic info. Gives developers the ability to code the controls, shapes, and layers of the maps, and can summon the birds-eye, 3D, and aerial imagery. For commercial applications Bing Maps Web Services is a set of programmable SOAP services that allow users to integrate maps and imagery, driving directions, and other location features into a Web application.            ","desc_exceeding":"","api_url":"foobar.com","mod_sent":0,"is_duplicate":0,"idNo":4}]}